import Link from "next/link"

export default function Greeting() {
  return (
    <section>
      <div className="bg-neutral-100">
        <div className="pt-11 pb-12 ml-auto mr-auto max-w-iph12">
          <h5 className="text-center text-lg tracking-wider text-zinc-400 mt-8 mb-7">
            INVITATION
          </h5>
          <p className="text-center leading-9 text-stone-900">
            서로가 마주보며 다져온 사랑을 <br />
            이제 함께 한 곳을 바라보며 <br />
            걸어갈 수 있는 큰 사랑으로 키우고자 합니다. <br />
            저희 두 사람이 사랑의 이름으로 <br />
            지켜나갈 수 있게 앞날을 <br />
            축복해 주시면 감사하겠습니다.
          </p>
        </div>
      </div>
      <div className="bg-white">
        <div className="flex pt-20 pb-10 ml-auto mr-auto max-w-iph12">
          <div className="flex-auto w-50 text-center">
            <dl>
              <dt className="text-lg text-stone-900">신랑에게 연락하기</dt>
              <dd>
                <Link
                  href="tel:01011112222"
                  className="block ml-auto mr-auto mt-3.5 w-7"
                >
                  <svg
                    xmlns="http://www.w3.org/2000/svg"
                    width="26px"
                    height="26px"
                    viewBox="0 0 24 24"
                    fill="none"
                  >
                    <path
                      d="M16.5562 12.9062L16.1007 13.359C16.1007 13.359 15.0181 14.4355 12.0631 11.4972C9.10812 8.55901 10.1907 7.48257 10.1907 7.48257L10.4775 7.19738C11.1841 6.49484 11.2507 5.36691 10.6342 4.54348L9.37326 2.85908C8.61028 1.83992 7.13596 1.70529 6.26145 2.57483L4.69185 4.13552C4.25823 4.56668 3.96765 5.12559 4.00289 5.74561C4.09304 7.33182 4.81071 10.7447 8.81536 14.7266C13.0621 18.9492 17.0468 19.117 18.6763 18.9651C19.1917 18.9171 19.6399 18.6546 20.0011 18.2954L21.4217 16.883C22.3806 15.9295 22.1102 14.2949 20.8833 13.628L18.9728 12.5894C18.1672 12.1515 17.1858 12.2801 16.5562 12.9062Z"
                      fill="#d7d4cc"
                    />
                  </svg>
                </Link>
              </dd>
            </dl>
            <h5 className="mt-9 mb-9 text-sm text-zinc-600">신랑 측 혼주</h5>
            <dl>
              <dt className="text-base flex items-center justify-center">
                <span className="block mr-1 text-sm">어머니</span>김영희
              </dt>
              <dd>
                <Link
                  href="tel:01011112222"
                  className="block ml-auto mr-auto mt-3.5 w-7"
                >
                  <svg
                    xmlns="http://www.w3.org/2000/svg"
                    width="26px"
                    height="26px"
                    viewBox="0 0 24 24"
                    fill="none"
                  >
                    <path
                      d="M16.5562 12.9062L16.1007 13.359C16.1007 13.359 15.0181 14.4355 12.0631 11.4972C9.10812 8.55901 10.1907 7.48257 10.1907 7.48257L10.4775 7.19738C11.1841 6.49484 11.2507 5.36691 10.6342 4.54348L9.37326 2.85908C8.61028 1.83992 7.13596 1.70529 6.26145 2.57483L4.69185 4.13552C4.25823 4.56668 3.96765 5.12559 4.00289 5.74561C4.09304 7.33182 4.81071 10.7447 8.81536 14.7266C13.0621 18.9492 17.0468 19.117 18.6763 18.9651C19.1917 18.9171 19.6399 18.6546 20.0011 18.2954L21.4217 16.883C22.3806 15.9295 22.1102 14.2949 20.8833 13.628L18.9728 12.5894C18.1672 12.1515 17.1858 12.2801 16.5562 12.9062Z"
                      fill="#d7d4cc"
                    />
                  </svg>
                </Link>
              </dd>
            </dl>
          </div>
          <div className="flex-auto w-50 text-center">
            <dl>
              <dt className="text-lg text-stone-900">신부에게 연락하기</dt>
              <dd>
                <Link
                  href="tel:01011112222"
                  className="block ml-auto mr-auto mt-3.5 w-7"
                >
                  <svg
                    xmlns="http://www.w3.org/2000/svg"
                    width="26px"
                    height="26px"
                    viewBox="0 0 24 24"
                    fill="none"
                  >
                    <path
                      d="M16.5562 12.9062L16.1007 13.359C16.1007 13.359 15.0181 14.4355 12.0631 11.4972C9.10812 8.55901 10.1907 7.48257 10.1907 7.48257L10.4775 7.19738C11.1841 6.49484 11.2507 5.36691 10.6342 4.54348L9.37326 2.85908C8.61028 1.83992 7.13596 1.70529 6.26145 2.57483L4.69185 4.13552C4.25823 4.56668 3.96765 5.12559 4.00289 5.74561C4.09304 7.33182 4.81071 10.7447 8.81536 14.7266C13.0621 18.9492 17.0468 19.117 18.6763 18.9651C19.1917 18.9171 19.6399 18.6546 20.0011 18.2954L21.4217 16.883C22.3806 15.9295 22.1102 14.2949 20.8833 13.628L18.9728 12.5894C18.1672 12.1515 17.1858 12.2801 16.5562 12.9062Z"
                      fill="#d7d4cc"
                    />
                  </svg>
                </Link>
              </dd>
            </dl>
            <h5 className="mt-9 mb-9 text-sm text-zinc-600">신부 측 혼주</h5>
            <dl>
              <dt className="text-base flex items-center justify-center">
                <span className="block mr-1 text-sm">아버지</span>한희승
              </dt>
              <dd>
                <Link
                  href="tel:01011112222"
                  className="block ml-auto mr-auto mt-3.5 w-7"
                >
                  <svg
                    xmlns="http://www.w3.org/2000/svg"
                    width="26px"
                    height="26px"
                    viewBox="0 0 24 24"
                    fill="none"
                  >
                    <path
                      d="M16.5562 12.9062L16.1007 13.359C16.1007 13.359 15.0181 14.4355 12.0631 11.4972C9.10812 8.55901 10.1907 7.48257 10.1907 7.48257L10.4775 7.19738C11.1841 6.49484 11.2507 5.36691 10.6342 4.54348L9.37326 2.85908C8.61028 1.83992 7.13596 1.70529 6.26145 2.57483L4.69185 4.13552C4.25823 4.56668 3.96765 5.12559 4.00289 5.74561C4.09304 7.33182 4.81071 10.7447 8.81536 14.7266C13.0621 18.9492 17.0468 19.117 18.6763 18.9651C19.1917 18.9171 19.6399 18.6546 20.0011 18.2954L21.4217 16.883C22.3806 15.9295 22.1102 14.2949 20.8833 13.628L18.9728 12.5894C18.1672 12.1515 17.1858 12.2801 16.5562 12.9062Z"
                      fill="#d7d4cc"
                    />
                  </svg>
                </Link>
              </dd>
              <dt className="text-base flex items-center justify-center mt-4">
                <span className="block mr-1 text-sm">어머니</span>최수연
              </dt>
              <dd>
                <Link
                  href="tel:01011112222"
                  className="block ml-auto mr-auto mt-3.5 w-7"
                >
                  <svg
                    xmlns="http://www.w3.org/2000/svg"
                    width="26px"
                    height="26px"
                    viewBox="0 0 24 24"
                    fill="none"
                  >
                    <path
                      d="M16.5562 12.9062L16.1007 13.359C16.1007 13.359 15.0181 14.4355 12.0631 11.4972C9.10812 8.55901 10.1907 7.48257 10.1907 7.48257L10.4775 7.19738C11.1841 6.49484 11.2507 5.36691 10.6342 4.54348L9.37326 2.85908C8.61028 1.83992 7.13596 1.70529 6.26145 2.57483L4.69185 4.13552C4.25823 4.56668 3.96765 5.12559 4.00289 5.74561C4.09304 7.33182 4.81071 10.7447 8.81536 14.7266C13.0621 18.9492 17.0468 19.117 18.6763 18.9651C19.1917 18.9171 19.6399 18.6546 20.0011 18.2954L21.4217 16.883C22.3806 15.9295 22.1102 14.2949 20.8833 13.628L18.9728 12.5894C18.1672 12.1515 17.1858 12.2801 16.5562 12.9062Z"
                      fill="#d7d4cc"
                    />
                  </svg>
                </Link>
              </dd>
            </dl>
          </div>
        </div>
        <p className="text-center pb-10 text-stone-700 text-xs">
          축하 화환은 정중히 사양합니다.
          <br /> 감사한 마음만 받겠습니다.
        </p>
      </div>
    </section>
  )
}
